Revit 2024 API
BuiltInFailures.GroupFailures.NoAppropriateGroup Property
 There is no Group that can be placed in the current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoAppropriateGroup { get; }
Visual Basic
Public Shared ReadOnly Property NoAppropriateGroup As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoAppropriateGroup {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace